       program-id. helloworld as "helloworld".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           display 'Hello COBOL World!'.

           goback.

       end program helloworld.